templates/inventory/version-2-0-0/get-inventory-levels.xml

<?xml version='1.0' encoding='utf-8'?>
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:GetInventoryLevelsRequest xmlns:ns0="http://www.promostandards.org/WSDL/Inventory/2.0.0/">
            <ns1:wsVersion xmlns:ns1="http://www.promostandards.org/WSDL/Inventory/2.0.0/SharedObjects/">
                {{wsVersion}}
            </ns1:wsVersion>
            <ns2:id xmlns:ns2="http://www.promostandards.org/WSDL/Inventory/2.0.0/SharedObjects/">
                {{username}}
            </ns2:id>
            <ns3:password xmlns:ns3="http://www.promostandards.org/WSDL/Inventory/2.0.0/SharedObjects/">
                {{password}}
            </ns3:password>
            <ns4:productId xmlns:ns4="http://www.promostandards.org/WSDL/Inventory/2.0.0/SharedObjects/">
                {{productId}}
            </ns4:productId>
        </ns0:GetInventoryLevelsRequest>
    </soap-env:Body>
</soap-env:Envelope>
